## Data Analysis Project

In [2]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt

## Load And Explore Dataset

In [29]:
df=pd.read_csv("customers_data.csv")
df.shape
df.columns

Index(['InvoiceID', 'CustomerID', 'Gender', 'Age', 'City', 'ProductCategory',
       'Quantity', 'UnitPrice', 'TotalAmount', 'PurchaseDate',
       'PaymentMethod'],
      dtype='object')

In [21]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 509 entries, 0 to 523
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   InvoiceID        509 non-null    float64
 1   CustomerID       509 non-null    float64
 2   Gender           509 non-null    object
 3   Age              509 non-null    float64
 4   City             509 non-null    object
 5   ProductCategory  509 non-null    object
 6   Quantity         509 non-null    object
 7   UnitPrice        509 non-null    object
 8   TotalAmount      509 non-null    float64
 9   PurchaseDate     509 non-null    object
 10  PaymentMethod    509 non-null    object
dtypes: float64(4), object(7)
memory usage: 47.7+ KB

          InvoiceID   CustomerID         Age   TotalAmount
count    509.000000   509.000000  509.000000    509.000000
mean   10252.660118  2500.459725   42.278978   7898.701375
std      144.610257   291.524659   13.492954   5908.876915
min    10001.000000  2001.000000   18.000000     56.000000
25%    10126.000000  2232.000000   31.000000   3056.000000
50%    10255.000000  2502.000000   43.000000   6618.000000
75%    10377.000000  2751.000000   54.000000  11529.000000
max    10500.000000  2996.000000   64.000000  24830.000000

In [17]:
#count of missing values (null values)
df.isnull().sum()

InvoiceID          15
CustomerID         15
Gender             15
Age                15
City               15
ProductCategory    15
Quantity           15
UnitPrice          15
TotalAmount        15
PurchaseDate       14
PaymentMethod      15
dtype: int64

## Data Cleaning

In [60]:
# Removing Null Values
df=df.dropna()
df

# removing duplicates
df=df.drop_duplicates()

# replacing values
df["Gender"]=df["Gender"].replace("Unknown","Others")

df["Quantity"]=df["Quantity"].replace("five",5)

df["UnitPrice"]=df["UnitPrice"].replace("??","NaN")

#how to correct date format
#df["PurchaseDate"]=pd.to_datetime(d)




# checking data types of each column
df.dtypes

InvoiceID          float64
CustomerID         float64
Gender              object
Age                float64
City                object
ProductCategory     object
Quantity            object
UnitPrice           object
TotalAmount        float64
PurchaseDate        object
PaymentMethod       object
Age_Group           object
dtype: object

## Feature Engineering

In [58]:
# create age groups
def age_group(age):
    if age<20:
        return "teenager"
    elif age>=20 and age<40:
        return "young adult"
    elif age>=40 and age<60:
        return "adult"
    else:
        return "senior citizen"
df["Age_Group"]=df["Age"].apply(age_group)
df

# create category sales
Category_sales=df.groupby("ProductCategory")["TotalAmount"].sum().reset_index()
Category_sales

# male vs female sales
Gender_sales=df.groupby("Gender")["TotalAmount"].sum().reset_index()
Gender_sales

#city wise sales
city_sales=df.groupby("City")["TotalAmount"].sum().reset_index()
city_sales

    City  TotalAmount
0  Metro    1277081.0
1  Rural    1275143.0
2  Urban    1243079.0